# Encoding

In [1]:
#importing the libraries
import numpy as np
import pandas as pd

In [13]:
#Creating a dataframe with categorical variable
data = [['Short'],['Tall'],['Medium']]
df = pd.DataFrame(data, columns = ['Height'])
df

   Height
0   Short
1    Tall
2  Medium

# Label Encoding

In [3]:
from sklearn import preprocessing

In [4]:
Label_Encoder = preprocessing.LabelEncoder()

In [5]:
df['Height'] = Label_Encoder.fit_transform(df['Height'])

In [6]:
df

   Height
0       1
1       2
2       0

Here
Medium = 0,
Tall = 2 and
Short = 1.
But, we know the column can be ranked as Tall > Medium > Short.
In this case we can use Find and Replace to give values as Short = 0, Medium = 1 and Tall = 2 which is more appropriate.

# OneHot Encoding/Get dummies

In [51]:
#Creating a dataframe with categorical variable COUNTRY
data = [['India',18000],['US',45000],['Japan',40000],['US',27000],['Japan',41000]]
DF = pd.DataFrame(data, columns = ['Country','Salary'])
DF

  Country  Salary
0   India   18000
1      US   45000
2   Japan   40000
3      US   27000
4   Japan   41000

In [52]:
DF = pd.get_dummies(DF, columns = ['Country'])

In [53]:
DF

   Salary  Country_India  Country_Japan  Country_US
0   18000              1              0           0
1   45000              0              0           1
2   40000              0              1           0
3   27000              0              0           1
4   41000              0              1           0